In [1]:
# Q.1
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [2]:
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [3]:
x = obj2['California']
obj2['California'] != x

True

In [4]:
import math
math.isnan(obj2['California'])

True

In [5]:
obj3['California']

True

In [6]:
obj3['California'] == None

False

In [7]:
# Q.2

d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
      '5': 'Ryan'
}
S = pd.Series(d)
S

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

In [8]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [11]:
S.iloc[0:2]

1    Alice
2      Bob
dtype: object

In [38]:
# Q.4
datas = {'gre score':[337,324,316,322,314], 'toefl score':[118,107,104,110,103]}
df = pd.DataFrame(datas)
df.head()

   gre score  toefl score
0        337          118
1        324          107
2        316          104
3        322          110
4        314          103

In [39]:
df.where(df['toefl score'] > 105).dropna()

   gre score  toefl score
0      337.0        118.0
1      324.0        107.0
3      322.0        110.0

In [40]:
df[df['toefl score'] > 105]

   gre score  toefl score
0        337          118
1        324          107
3        322          110

In [41]:
df[(df['toefl score'] > 105) & (df['toefl score'] < 115)]

   gre score  toefl score
1        324          107
3        322          110

In [43]:
df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]

   gre score  toefl score
1        324          107
3        322          110

In [45]:
df[(df['toefl score'].isin(range(106,115)))]

   gre score  toefl score
1        324          107
3        322          110

In [44]:
(df['toefl score'] > 105) & (df['toefl score'] < 115)

0    False
1     True
2    False
3     True
4    False
Name: toefl score, dtype: bool

In [ ]:
df['toefl score'].gt(105) & df['toefl score'].lt(115)

In [37]:
# Q.6

datas = {'one':[0,4,8,12], 'two':[1,5,9,13], 'three':[2,6,10,14], 'four':[3,7,11,15]}
df = pd.DataFrame(datas, index=['ohio', 'colorado', 'utah', 'new york'])
df.head()

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [16]:
df.drop('ohio')

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [17]:
df.drop(['utah', 'colorado'])

          one  two  three  four
ohio        0    1      2     3
new york   12   13     14    15

In [18]:
df.drop('one', axis=1)

          two  three  four
ohio        1      2     3
colorado    5      6     7
utah        9     10    11
new york   13     14    15

In [20]:
# df.drop('two') -> not works
df.drop('two', axis=1)

          one  three  four
ohio        0      2     3
colorado    4      6     7
utah        8     10    11
new york   12     14    15

In [21]:
# Q.7

s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [25]:
s1, s2

(1    Alice
 2     Jack
 3    Molly
 dtype: object,
 Alice    1
 Jack     2
 Molly    3
 dtype: int64)

In [26]:
s2[2]

3

In [30]:
# s2.loc[1] -> not works
s2.iloc[1]

2

In [31]:
s1.loc[1]

'Alice'

In [32]:
s1.append(s2)

1        Alice
2         Jack
3        Molly
Alice        1
Jack         2
Molly        3
dtype: object

In [33]:
for i in s1.iteritems():
    print(i)

(1, 'Alice')
(2, 'Jack')
(3, 'Molly')